#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fiap-postech-tsombra/terraform-cloud-database/runs/run-RQnGfrJSg8sLXeUH

Waiting for the plan to start...

Terraform v1.7.5
on linux_amd64
Initializing plugins and modules...
google_sql_database_instance.mydatabase: Refreshing state... [id=fast-food-db]
google_sql_database.mydatabase_db: Refreshing state... [id=projects/lateral-scion-414400/instances/fast-food-db/databases/fast-food-db]
google_sql_user.mydatabase_user: Refreshing state... [id=user//fast-food-db]
google_sql_database_instance.mydatabase: Drift detected (delete)
google_sql_user.mydatabase_user: Drift detected (delete)
google_sql_database.mydatabase_db: Drift detected (delete)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # google_sql_database_instance.mydatabase has been deleted
  - resource "google_sql_database_instance" "mydatabase" {
        id                             = "fast-food-db"
      - name                           = "fast-food-db" -> null
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_sql_database.mydatabase_db will be created
  + resource "google_sql_database" "mydatabase_db" {
      + charset         = "utf8"
      + collation       = "utf8_general_ci"
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "fast-food-db"
      + name            = "fast-food-db"
      + project         = "lateral-scion-414400"
      + self_link       = (known after apply)
    }

  # google_sql_database_instance.mydatabase will be created
  + resource "google_sql_database_instance" "mydatabase" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "MYSQL_8_0"
      + deletion_protection            = true
      + dns_name                       = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "fast-food-db"
      + private_ip_address             = (known after apply)
      + project                        = "lateral-scion-414400"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "southamerica-east1"
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + connector_enforcement = (known after apply)
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = 10
          + disk_type             = "PD_SSD"
          + edition               = "ENTERPRISE"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-f1-micro"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration {
              + binary_log_enabled             = true
              + enabled                        = true
              + start_time                     = "23:00"
              + transaction_log_retention_days = (known after apply)
            }

          + ip_configuration {
              + ipv4_enabled = true
              + ssl_mode     = (known after apply)
            }

          + maintenance_window {
              + day  = 1
              + hour = 0
            }
        }
    }

  # google_sql_user.mydatabase_user will be created
  + resource "google_sql_user" "mydatabase_user" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "fast-food-db"
      + name                    = "user"
      + password                = (sensitive value)
      + project                 = "lateral-scion-414400"
      + sql_server_user_details = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @tshadz, Action: `pull_request`*